nxp-mcuxpresso/mcux-soc-svd/KW43L43Z96/KW43L43Z96.xml
        <register>
          <name>ble_reg_rx_adv_pdu_type</name>
          <description>Rx Advertising Packet PDU Type, Control register of Bluetooth extended advertising packet PDU type.</description>
          <addressOffset>0x29C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6000087</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_extn_adv_pdu_type_0</name>
              <description>Extended advertising PDU type, Extended advertising PDU type defined has an advertising extension header and advData fields.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_adv_pdu_type_0_en</name>
              <description>Extended advertising PDU type enable, Use the defined extended advertising PDU type for Rx matching., 0x0: disable the defined PDU type for matching ext advertising, 0x1: enable the defined PDU type for matching ext advertising</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_adv_pdu_type_1</name>
              <description>Extended advertising PDU type, Extended advertising PDU type defined has an advertising extension header and advData fields.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_adv_pdu_type_1_en</name>
              <description>Extended advertising PDU type enable, Use the defined extended advertising PDU type for Rx matching., 0x0: disable the defined PDU type for matching ext advertising, 0x1: enable the defined PDU type for matching ext advertising</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_adv_pdu_type_2</name>
              <description>Extended advertising PDU type, Extended advertising PDU type defined has an advertising extension header and advData fields.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_adv_pdu_type_2_en</name>
              <description>Extended advertising PDU type enable, Use the defined extended advertising PDU type for Rx matching., 0x0: disable the defined PDU type for matching ext advertising, 0x1: enable the defined PDU type for matching ext advertising</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_adv_type_chk_val</name>
              <description>Received advertising PDU type check value, Regular advertising PDU type value to be checked for Rx matching. Rx packet's PDU type &lt;= rx_adv_type_chk_val is considered as valid regular advertising PDU.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_coded_pkt_cntrl</name>
          <description>LE Coded Packet Control</description>
          <addressOffset>0x2D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_coded_pkt_en</name>
              <description>Tx Coded Packet Enable, Tx Coded Packet Enable, 0x0: regular; use non-coded PHY to transmit packet, 0x1: use LE coded PHY to transmit packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_coded_pkt_indic</name>
              <description>Tx Coded Packet Indicator, When tx_coded_pkt_en is set; indicate LE coding scheme PHY uses to transmit packet. C=2; if 2'b01; C=8; if 2'b00.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_coded_pkt_en</name>
              <description>Rx Coded Packet Enable, Rx Coded Packet Enable, 0x0: regular; use non-coded PHY to receive packet, 0x1: use LE coded PHY to receive packet</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>simul_scan_en</name>
              <description>Simultaneous Scan Enable, Enable simultaneous scan mode to receive BLE 1M and coded PHY ADV packets; whichever has correlation hit first., 0x0: disable, 0x1: enable. When enabled; rx_coded_pkt_en bit must set to 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>simul_scan_1m</name>
              <description>Simultaneous Scan Results in 1M Mode; if Concurrent Correlation Hit., When simul_scan_en is 1; if both 1M and coded PHY correlators have correlation hit at the same time; this bit decides which mode to continue Rx. This bit has no effect if only 1 of the correlator has correlation hit., 0x0: Continue Rx in coded PHY packet mode - preferred as it takes longer time to, correlate the access address., 0x1: Continue Rx in BLE 1M mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_irk_base_addr</name>
          <description>IRK Resolution Base address</description>
          <addressOffset>0x2DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>irk_base_addr</name>
              <description>IRK Base Address, Programmable start of IRK storage address in EBRAM. EBRAM is shared with BrEdr logic. Therefore this start address is programmable; so that different platforms may be able to use different EBRAM configurations.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_irk_ctrl_0</name>
          <description>IRK Resolution Control 0</description>
          <addressOffset>0x2E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_irk_hash</name>
              <description>Software provided hash for IRK resolution, To perform a software driven IRK resolution; software writes the lower 24 bits of RPA address into this register. This value is called hash and is compared with hardware calculated hash to conclude on whether the key can be used to resolve addresses.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_irk_prand</name>
              <description>Software provided prand for IRK resolution, To perform a software driven IRK resolution; software writes part of upper 24 bits of RPA address into this register. This value is called prand[7:0] and is used to generate local hash.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_irk_ctrl_1</name>
          <description>IRK Resolution Control 1</description>
          <addressOffset>0x2E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_irk_prand</name>
              <description>Software provided hash for IRK resolution, To perform a software driven IRK resolution; software writes part of upper 24 bits of RPA address into this register. This value is called prand[23:8] and is used to generate local hash.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>irk_resolution_en</name>
              <description>IRK resolution enable, When this bit is set; hardware will parse incoming advt channel packets to attempt IRK resolution on resolvable private addresses. This bit does not affect software override/access to IRK locations in hardware EBRAM area. So; disabling this bit can be used as a backup to stop hardware driven IRK resolving; and use software provided values after packet has been fully received.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>irk_sw_lock</name>
              <description>Lock bits for Software IRK queue access, This bit allows software and hardware to access the EBRAM IRK queue locations safely., 0x0: IRK queue is not in use by software, 0x1: IRK queue is in use by software</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_irk_resolve_cmd</name>
              <description>Software IRK resolve command, This self clearing bit triggers a software requested IRK resolution process. The prand and hash values are provided in sw_irk_hash and sw_irk_prand fields. The software lock bit irk_sw_lock; should be set to 1 before the command is set. Self cleared by hardware</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>kill_irk_resolve</name>
              <description>Kill IRK resolve process, This bit will kill IRK resolve process and put the state machine back to idle. Software is responsible to clear this bit., 0x0: IRK resolve is not killed, 0x1: IRK resolve is killed by software</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>irk_queue_length</name>
              <description>Length of IRK queue in EBRAM, Specifies valid IRK queue length. All values between 0 to 255 are valid. If IRK queue is empty; this value should be set to 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_irk_status_0</name>
          <description>IRK Resolution Status 0</description>
          <addressOffset>0x2E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>irk_resolved_id_addr</name>
              <description>ID address for successful IRK resolution, If IRK resolution was successful; this register holds the lower 32 bits of the 48-bit ID address of the device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_irk_status_1</name>
          <description>IRK Resolution Status 1</description>
          <addressOffset>0x2EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x60000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>irk_resolved_id_addr</name>
              <description>ID address for successful IRK resolution, If IRK resolution was successful; this register holds the upper bits (47:32) of the 48 bit ID address of the device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>irk_resolved_id_addr_type</name>
              <description>ID address type for successful IRK resolution, If IRK resolution was successful; this register holds the Device Type information of the device.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>irk_resolution_result</name>
              <description>Result of latest IRK resolution, The values indicate if IRK resolution is finished or ongoing; successful or unsuccessful., 0x0: resolution in progress, 0x1: entry was found in IRK queue, 0x2: entry was not found in IRK queue, 0x3: IRK queue search not done for this packet</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>irk_hw_lock</name>
              <description>Lock bits for Hardware IRK EBRAM access, This bit allows software and hardware to access the IRK queue locations safely., 0x0: IRK queue is not in use by hardware, 0x1: IRK queue is in use by hardware</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>irk_fsm_state</name>
              <description>IRK resolve state machine status, This is the current vlaue of the IRK resolve state machine (for example irk_fsm_state).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>irk_resolve_position</name>
              <description>Position of last IRK queue lookup in EBRAM, This is the last offset that was searched. For successful resolutions; it is the offset where device IRK was found. For unsuccessful resolutions; this is the last offset in queue.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_whitelist_base_addr</name>
          <description>Whitelist Base address</description>
          <addressOffset>0x2F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>whitelist_base_addr</name>
              <description>WHITELIST BASE ADDR, Programmable start of Whitelist storage address in EBRAM. EBRAM is shared with BrEdr logic. Therefore this start address is programmable; so that different platforms may be able to use different EBRAM configurations.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_whitelist_ctrl_0</name>
          <description>Whitelist Search Control 0</description>
          <addressOffset>0x2F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_wl_device_addr_0</name>
              <description>Software provided device address for whitelist search, To perform a software whitelist query; software writes the lower 32 bits of device address into this register. This value is used together with some fields in next register BLE_REG_WHITELIST_CTRL_1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_whitelist_ctrl_1</name>
          <description>Whitelist Search Control 1</description>
          <addressOffset>0x2F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_wl_device_addr_1</name>
              <description>Software provided Device address for whitelist search, To perform a software whitelist query; software writes the upper 16 bits of device address into this register. Together with BLE_REG_WHITELIST_CTRL_0; this represents the 48-bit device address for software white list lookup.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_wl_device_type</name>
              <description>Software provided Device address type for whitelist search, This bit specifies the device address type to be used for software whitelist query., 0x0: public address, 0x1: random address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_wl_query_cmd</name>
              <description>Software whitelist query command, This self clearing bit triggers a software requested whitelist search for the device specified by sw_wl_device_type; sw_wl_device_addr_1 and sw_wl_device_addr_0 fields. The lock bit wl_sw_lock; should be set to 1 before the command is set. Self cleared by hardware.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>wl_sw_lock</name>
              <description>Lock bits for software whitelist access, This bit should be set by software when it is modifying the EBRAM whitelist area, 0x0: whitelist is not in use by software, 0x1: whitelist is in use by software</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>hw_wl_search_en</name>
              <description>Inline White list search enable, When this bit is set; hardware will parse incoming advt channel packets to attempt white list filtering inline. This bit does not affect software override/access to the whitelist operations in hardware EBRAM area. So; disabling this bit can be used as a backup to stop hardware driven whitelist searching; and use software provided values after packet has been fully received.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>kill_wl_search</name>
              <description>Kill whitelist search, This bit will kill whitelist search process and put the state machine back to idle. Software is responsible to clear this bit., 0x0: whitelist search is not killed, 0x1: whitelist search is killed by software</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>whitelist_length</name>
              <description>Length of whitelist in EBRAM, Specifies valid whitelist length. All values between 0 to 255 are valid. If whitelist is empty; this value should be set to 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
