nxp-mcuxpresso/mcux-soc-svd/KW43L43Z96/KW43L43Z96.xml
        <register>
          <name>ble_reg_int_mask_2</name>
          <description>BLE Interrupt Mask 2</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_done</name>
              <description>sw_aes_done interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_done_intr</name>
              <description>sw_dbus_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_mailbox_intr</name>
              <description>sw_mailbox_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_frame_sync_real_ie</name>
              <description>MWS Frame Sync Interrupt Enable, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_pattern_real_ie</name>
              <description>MWS Pattern Interrupt Enable, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>frame_sync_update_real_ie</name>
              <description>MWS Frame Sync Update Interrupt Enable, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>harq_pattern_sel_real_ie</name>
              <description>HARQ Pattern Sel Interrupt Enable, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_frequency_real_ie</name>
              <description>MWS Scan Frequency Interrupt Enable, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_inact_msg_real_ie</name>
              <description>MWS Inactivity Message Interrupt Enable, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_hw_abort_mask</name>
          <description>BLE Interrupt Mask; hardware Abort</description>
          <addressOffset>0x70C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_deny_sts</name>
              <description>ble_deny_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_cutoff_sts</name>
              <description>ble_cutoff_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_bcadeny_sts</name>
              <description>ble_bcadeny_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_bcacutoff_sts</name>
              <description>ble_bcacutoff_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cor_timeout_intr_sts</name>
              <description>cor_timeout_intr_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_sync_pulse_timeout_intr_sts</name>
              <description>rx_sync_pulse_timeout_intr_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_datavld_timeout_intr_sts</name>
              <description>rx_datavld_timeout_intr_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>txrx_error_sts</name>
              <description>txrx_error_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_abort_b4_a2_sts</name>
              <description>sw_abort_b4_a2_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_abort_after_a2_sts</name>
              <description>sw_abort_after_a2_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_cca_abort_sts</name>
              <description>ble_cca_abort_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_cca_abort_thd_met_sts</name>
              <description>ble_cca_abort_thd_met interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_cca_txpkt_thd_met_sts</name>
              <description>ble_cca_txpkt_thd_met interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rt_err_mask</name>
          <description>BLE Interrupt Mask; Real-time Error</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cutoff_intr</name>
              <description>ble_cutoff_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_extn_fail_intr</name>
              <description>ble_extn_fail_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_bcacutoff_intr</name>
              <description>ble_bcacutoff_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cor_timeout_intr</name>
              <description>cor_timeout_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_sync_pulse_timeout_intr</name>
              <description>rx_sync_pulse_timeout_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_datavld_timeout_intr</name>
              <description>rx_datavld_timeout_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_extn_ant_switch_fail_intr</name>
              <description>tx_extn_ant_switch_fail_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_extn_abort_intr</name>
              <description>tx_extn_abort_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_ant_switch_fail_intr</name>
              <description>rx_extn_ant_switch_fail_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_abort_intr</name>
              <description>rx_extn_abort_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_lock_fail_intr</name>
              <description>tx_lock_fail_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_dmem_underflow_intr</name>
              <description>tx_dmem_underflow_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_aes_underflow_intr</name>
              <description>tx_aes_underflow_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_lock_fail_intr</name>
              <description>rx_lock_fail_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_dmem_overflow_intr</name>
              <description>rx_dmem_overflow_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_aes_underflow_intr</name>
              <description>rx_aes_underflow_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_length_err_intr</name>
              <description>rx_length_err_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ahb_error</name>
              <description>ahb_error interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_error</name>
              <description>dma_error interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
