nxp-mcuxpresso/mcux-soc-svd/KW43L43Z96/KW43L43Z96.xml
        <register>
          <name>ble_reg_debug_bank_sel</name>
          <description>BLE debug test bus bank selection set</description>
          <addressOffset>0xE14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_bank_select_1</name>
              <description>BLE debug test bus selection [3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>testbus_bank_select_2</name>
              <description>BLE debug test bus selection [7:4]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>testbus_bank_select_3</name>
              <description>BLE debug test bus selection [11:8]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>testbus_bank_select_4</name>
              <description>BLE debug test bus selection [15:12]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ip_revision</name>
          <description>BTU IP Revision</description>
          <addressOffset>0xE20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>btu_ip_rev</name>
              <description>BLE IP Revision, Bits[15:8] = major revision number (incremented at full tapeout), Bits[7:0] = minor revision number (incremented at post tapeout ECO), 88W8787 (Robin) = 0x0800 88W8790 (uBB) = 0x0800 88W8797 (Starling) = 0x900 88W8766 (Geagle) = 0x0900 88W8897 (Kfisher) = 0x1100 88W8777 (Robin2) = 0x1200 88W8887 (CardiAC) = 0x1300 8830 (Sunbird/BTHM) = 0x1400 88W8977 (Robin3/BTU2) = 0x1600 88W8997 (Kfisher2/BTU2) = 0x1700 88W8987 (Cardi2/BTU2) = 0x1700 88W9064 (SCBT/BTU2) = 0x2100 88W9098 (Skyhawk/BTU2) = 0x2200 88W9000 (Kestrel/BTU2) = 0x2400 88W8978 (Robin3P/BTU2) = 0x2500 Firecrest/BTU2 = 0x2700 K4W1 (NBU/BTU2) = 0x2800 Redfinch/BLE_only = 0x2600 Owl/BTU2 = 0x2900 Tasman/BLE_only = 0x3000 Kamet/BTU2 = 0x3100 Blackbird/BTU2 = 0x3200 KW47 (NBU/BTU2) = 0x3400 Hood/BTU2 = 0x3500 Fuji (NBU/BTU2) = 0x3600 MW30 (NBU/BTU2) = 0x3400</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_margin</name>
          <description>BLE AES Margin</description>
          <addressOffset>0xE30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FF03FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_aes_mrgn_min</name>
              <description>ble_tx_aes_mrgn_min, Minimum AES operating margin in quarter us during TX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_tx_aes_ur</name>
              <description>ble_tx_aes_ur, BLE TX AES underrun status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_tx_aes_mrgn_en</name>
              <description>ble_tx_aes_mrgn_en, Enable BLE TX AES monitoring. When disabled; the minimum AES margin resets to 'h3ff</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_aes_mrgn_min</name>
              <description>ble_rx_aes_mrgn_min, Minimum AES operating margin in quarter us cycles during RX</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_rx_aes_ur</name>
              <description>ble_rx_aes_ur, BLE RX AES underrun status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_rx_aes_mrgn_en</name>
              <description>ble_rx_aes_mrgn_en, Enable BLE RX AES monitoring. When disabled; the minimum AES margin resets to 'h3ff</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_dma_margin</name>
          <description>BLE DMA Margin</description>
          <addressOffset>0xE34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FF03FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_dma_mrgn_min</name>
              <description>ble_tx_dma_mrgn_min, Minimum DMA operating margin in quarter us during TX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_tx_dma_uf</name>
              <description>ble_tx_dma_uf, BLE TX DMA underflow status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_tx_dma_mrgn_en</name>
              <description>ble_tx_dma_mrgn_en, Enable BLE TX DMA monitoring. When disabled; the minimum DMA margin resets to 'h3ff</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_dma_mrgn_min</name>
              <description>ble_rx_dma_mrgn_min, Minimum DMA operating margin in quarter us during RX</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_dfe_dma_of</name>
              <description>ble_dfe_dma_of, BLE RX DFE DMA overflow status</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_rx_dma_of</name>
              <description>ble_rx_dma_of, BLE RX DMA overflow status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_rx_dma_mrgn_en</name>
              <description>ble_rx_dma_mrgn_en, Enable BLE RX DMA monitoring. When disabled; the minimum DMA margin resets to 'h3ff</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ahb_lat</name>
          <description>BLE AHB Latency Monitors</description>
          <addressOffset>0xE3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_slv_txn_max</name>
              <description>ble_slv_txn_max, Maximum BLE slave transaction latency in number of HCLK cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_mst_txn_max</name>
              <description>ble_mst_txn_max, Maximum BLE master transaction latency in number of HCLK cycles</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_mst_arb_max</name>
              <description>ble_mst_arb_max, Maximum BLE master arbitration latency in number of HCLK cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_slv_txn_en</name>
              <description>ble_slv_txn__en, Enable BLE slave transaction latency monitor. When disabled; the maximum latency is reset to 0</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_mst_txn_en</name>
              <description>ble_mst_txn_en, Enable BLE master transaction latency monitor. When disabled; the maximum latency is reset to 0</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_mst_arb_en</name>
              <description>ble_mst_arb_en, Enable BLE master arbitration latency monitor. When disabled; the maximum latency is reset to 0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_debug_rvsd</name>
          <description>Debug reserved</description>
          <addressOffset>0xE80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>brf_pu_opt_en</name>
              <description>BRF powerup Optimization Enable, Enable BRF_PU optimization to save power in BRF-FRF cross connect mode of Firecrest A1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_nat_clk_sleep_wr_en</name>
              <description>BLE Native Clock Sleep write enable, Enable CPU write to BLE Native Clock in sleep domain. FW needs to set this bit before writing to BLE_REG_TMR_NATIVE_CLOCK register; and must clear this bit after the write is done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>swtpast_eco_disable</name>
              <description>SWT past Intr ECO disable, Disable bit for SWT past intr WIPBTU-478 fix, 0x0: WIPBTU-478 fix is enabled in Owl A1, 0x1: WIPBTU-478 fix is disabled; older logic preserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cca_coex_eco_dis</name>
              <description>CCA Coex ECO disable, Disable bit for CCA BTC+BLE coex TXPkt/TxAbort counters WIPBTU-546, 0x0: WIPBTU-546 fix is enabled in BB A1, 0x1: WIPBTU-546 fix is disabled; older logic preserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>debug_rvsd</name>
              <description>Debug Reserved, BLE-side reserved registers to be used for future ECO.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
