nxp-mcuxpresso/mcux-soc-svd/KW43L43Z96/KW43L43Z96.xml
        <register>
          <name>btu_rif_ble_cor_window_0</name>
          <description>BLE Correlation Window Size</description>
          <addressOffset>0xCA8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cor_window_0</name>
              <description>BLE Correlation Window Size, BLE correlation window size for the current Rx packet (lower 16-bit)., Correlation window in 1/4 usec. Hardware will automatically abort Rx operation up expiration of this window time. Maximum window size: 2^26/4 = 16777216 usec.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_cor_window_1</name>
          <description>BLE Correlation Window Size</description>
          <addressOffset>0xCAA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cor_window_1</name>
              <description>BLE Correlation Window Size, BLE correlation window size for the current Rx packet (Upper 10-bit)., Correlation window in 1/4 usec. Hardware will automatically abort Rx operation up expiration of this window time. Maximum window size: 2^26/4 = 16777216 usec.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_clk_en_delay</name>
          <description>Tx/Rx Clock Enable Signal Delay</description>
          <addressOffset>0xCAC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1A6A</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tx_clk_en_delay_qus</name>
              <description>Tx_clk_en Delay Offset, This is the delay offset for the tx_clk_en signal from the Tx S pulse., - Resolution: 1/4 usec.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_clk_en_delay_qus</name>
              <description>Rx_clk_en Delay Offset, This is the delay offset for the rx_clk_en signal from the Rx P pulse., - Resolution: 1/4 usec.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_go_delay</name>
          <description>RIF Go Signal Delay</description>
          <addressOffset>0xCAE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2E7E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_tx_go_delay_qus</name>
              <description>RIF_TX_GO Delay Offset, This is the delay offset for the rif_tx_go signal from the Tx S pulse., - Res: 1/4 usec.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rif_rx_go_delay_qus</name>
              <description>RIF_RX_GO Delay Offset, This is the delay offset for the rif_rx_go signal from the Rx P pulse., - Res: 1/4 usec.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_dbus_tx_pwrctl_wdata</name>
          <description>Tx Power Control DBUS Write Data</description>
          <addressOffset>0xCB0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_dbus_tx_pwrctl_wdata</name>
              <description>Tx Power Control DBUS Write Data, Tx A1 pulse., - Bits[9:8]: Tx data rate, - Bits[7:0]: Tx power table index, 0x0: reserved, 0x1: BDR 1 Mbps / BLE 1 Mbps / ANT 1 Mbps, 0x2: EDR 2 Mbps / BLE 2 Mbps, 0x3: EDR 3 Mbps</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_dbus_tx_fsyn_wdata</name>
          <description>Tx Fsyn DBUS Write Data</description>
          <addressOffset>0xCB2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_dbus_tx_fsyn_wdata</name>
              <description>Tx Fsyn DBUS Write Data, Tx A2 pulse., - Bits[15:13]: Bluetooth mode - BTC; BLE; NIKE; ANT or LLR, - Bit[12]: Rx notch filter enable, - Bit[11]: reserved, - Bit[10]: power up BRF BG/CPREG, - Bits[9:8]: Bluetooth state - Tx; Rx, - Bit[7]: large correlation window indicator, - Bits[6:0]: Bluetooth channel from 0 to 78</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_dbus_rx_pwrctl_wdata</name>
          <description>Rx Power Control DBUS Write Data</description>
          <addressOffset>0xCB4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_dbus_rx_pwrctl_wdata</name>
              <description>Rx Power Control DBUS Write Data, Rx A1 pulse., - Bits[15:14]: reserved, - Bit[13]: BLE MI estimation enable, - Bit[11]: Rx link BDR/EDR packet type, - Bit[10]: Rx channel estimation using noise floor, - Bits[9:8]: indicate which syncword correlator to use, - Bits[7:4]: Rx link index from 0 to 9, - Bits[1:0]: Rx power mode (when low power scan mode is normal mode; selects from either normal or performance mode), ,Enum, - Bit[12]: BLE Rx data rate, 0x0: 1 Mbps (also for BTC; ANT), 0x1: 2 Mbps, ,Enum, - Bits[2]: BLE channel assessment mode, 0x0: Single channel, 0x1: V_1, Multiple channels (ch; ch+1; ch+2 ... ch+9)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_dbus_rx_fsyn_wdata</name>
          <description>Rx Fsyn DBUS Write Data</description>
          <addressOffset>0xCB6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_dbus_rx_fsyn_wdata</name>
              <description>Rx Fsyn DBUS Write Data, Rx A2 pulse., - Bits[15:13]: Bluetooth mode - BTC; BLE; NIKE; ANT or LLR, - Bit[12]: Rx notch filter enable, - Bit[11]: reserved, - Bit[10]: power up BRF BG/CPREG, - Bits[9:8]: Bluetooth state - Tx; Rx, - Bit[7]: large correlation window indicator, - Bit[6:0]: Bluetooth channel from 0 to 78</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_rx_sync_delay</name>
          <description>BLE Rx Sync Delay</description>
          <addressOffset>0xCB8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_rx_syncpulse_delay</name>
              <description>The BLE packet PDU sync pulse max delay from correlation hit pulse. Watchdog timer value for sync pulse from BRF at the start of PDU. Hardware will automatically abort Rx operation upon expiration of the watchdog timer. Res: 1 usec.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_datavld_delay</name>
              <description>In Rx bursting mode; the BLE packet PDU bursting data valid max delay from last end of data valid or sync pulse. Watchdog timer value for sync pulse from BRF at the start of PDU. Hardware will automatically abort Rx operation upon expiration of the watchdog timer. Res: 1 usec.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_rx_pkt_status</name>
          <description>RIF dBus Rx Packet Status</description>
          <addressOffset>0xCBA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_pwr_adjd</name>
              <description>BLE Tx power adjusted status, This bit indicates that BLE TX power was adjusted by BCA feedback. This bit is cleared on read. It is valid shortly after BCA grant is received; for each BLE TX packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rf_bt_test_mode_en</name>
              <description>Enable BRF Bluetooth Test Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bfdbk_tx_power_4m_ble_rdbk</name>
              <description>BCA Feedback power for BLE packet, Feedback power value received from BCA for BLE TX packet. This value is overwritten when new BLE power level override is feedback from BCA.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_rx_modetype</name>
          <description>RIF dBus Rx Mode Type</description>
          <addressOffset>0xCBC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rf_rx_mode_type_resrv</name>
              <description>reserved register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_rx_cte_len_addr</name>
          <description>RIF Register</description>
          <addressOffset>0xCBE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_cte_len_addr</name>
              <description>Radio Register Address for Rx CTE Length, The BRF register of the expected Rx CTE length., - Units: 8 micro-seconds.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_arb_ble_start_time_coded</name>
          <description>RIF ARB BLE Start Time, Delay till sampled bt_grant_n is sampled.</description>
          <addressOffset>0xCC2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5454</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_tx_req will start after start_rif_tx (Tx Request from BLE to RIF-ARB for radio access) is issued from BLE., - Resolution: 1/4 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_rx_req will start after start_rif_rx (Rx request from BLE to RIF-ARB for Radio access) is issued., - Resolution : 1/4 us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_arb_ble_start_time_1m</name>
          <description>RIF ARB BLE Start Time, Delay till sampled bt_grant_n is sampled.</description>
          <addressOffset>0xCC4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5454</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_tx_req will start after start_rif_tx (Tx Request from BLE to RIF-ARB for radio access) is issued from BLE., - Resolution: 1/4 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_rx_req will start after start_rif_rx (Rx request from BLE to RIF-ARB for Radio access) is issued., - Resolution : 1/4 us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_arb_ble_start_time_2m</name>
          <description>RIF ARB BLE Start Time, Delay till sampled bt_grant_n is sampled.</description>
          <addressOffset>0xCC6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5454</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_tx_req will start after start_rif_tx (Tx Request from BLE to RIF-ARB for radio access) is issued from BLE., - Resolution: 1/4 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_rx_req will start after start_rif_rx (Rx request from BLE to RIF-ARB for Radio access) is issued., - Resolution : 1/4 us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_arb_ctl</name>
          <description>RIF ARB Control</description>
          <addressOffset>0xCC8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_sw_abort</name>
              <description>If set; current BLE traffic will be aborted and ble_sw_abort_intr will be issued., This bit cleared by hardware; after ble_sw_abort_intr is issued., If there is no ongoing BLE traffic; then there is no abort happening. But ble_sw_abort_intr will be issued anyway. It is software requirement to issue ble_sw_abort_intr weather there was ongoing BLE traffic got aborted or not.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>rst_rif_arb_fsm</name>
              <description>RIF-ARB Reset, If set; RIF-ARB fsm will reset and transition to idle state. Firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_sync_frame_en</name>
              <description>Enable ble_sync_frame in arbitration decision, Enable considering ble_sync_frame in arbitration decision, 0x0: disable, 0x1: enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rif_collide</name>
              <description>KW47 Deadlock condition detection; with interrupt generation on ble_cutoff, This bit is set if there is a rising edge on rif_tx or rx during an on-going transaction. This bit gets cleared with a WtiteOne</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_cca_grant_offset_time</name>
          <description>BTU CCA GRANT OFFSET TIME, BTU CCA Grant Offset Time</description>
          <addressOffset>0xCCC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3800</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cca_grant_offset_time</name>
              <description>BLE CCA Grant Offset time, Offset to the delay when bt_grant_n is sampled and rif_tx_start will start after rifTx (Tx request from BLE to RIF-ARB for radio access) is issued from BLE. This offset is only used in TX packets; and when ble_tx_cca_en is also set to 1., - Resolution: 0.25us</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_cca_tx_fesw_offset_time</name>
          <description>BTU CCA TX FESW OFFSET TIME, BTU CCA TX FESW Offset Time</description>
          <addressOffset>0xCCE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2A00</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cca_tx_fesw_offset_time</name>
              <description>BLE CCA TX FESW Offset time, Offset to the delay assertion of bttx_fesw in CCA mode to curb during CCA (RX) operation is ongoing. This offset is added on to tx_fesw_on_delay. This offset is only used in BLE TX packets; and when ble_tx_cca_en is also set to 1., - Resolution: 1us</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_testbus_sel_0</name>
          <description>RIF Testbus Select 0</description>
          <addressOffset>0xCD0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btu_testbus_sel_0</name>
              <description>RIF Testbus Select; Lower Bits, Lower 15 bits of btu_testbus_sel; if, (btu_testbus_sel[i*2];btu_testbus_sel[i*2+1]) set to:, 0x0: get btc_testbus_out[i], 0x1: get ble_testbus_out[i], 0x2: get ble_debug_sw_msg_out(URAT), 0x3: get ble_test_sw_out[i]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_testbus_sel_1</name>
          <description>RIF Testbus Select 1</description>
          <addressOffset>0xCD2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btu_testbus_sel_1</name>
              <description>RIF Testbus Select; Upper Bits, Upper 15 bits of btu_testbus_sel; if, (btu_testbus_sel[i*2];btu_testbus_sel[i*2+1]) set to:, 0x0: get btc_testbus_out[i], 0x1: get ble_testbus_out[i], 0x2: get ble_debug_sw_msg_out(URAT), 0x3: get ble_test_sw_out[i]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_testbus_oe</name>
          <description>BTU Testbus Output Enable</description>
          <addressOffset>0xCD4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btu_testbus_oe_</name>
              <description>Debug testbus output enable, Active low BTU testbus output enables.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_reg_debug_sw_outdata</name>
          <description>BLE Debug Output Data</description>
          <addressOffset>0xCD6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_sw_out</name>
              <description>BLE debug software control testbus ouput, Only when btu_testbus_overrdie_by_ble_sw = 1; this software testbus is the BLE testbus output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_reg_debug_indata</name>
          <description>BLE Debug Input Data</description>
          <addressOffset>0xCD8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_in</name>
              <description>BLE debug testbus input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
