nxp-mcuxpresso/mcux-soc-svd/KW43L43Z96/KW43L43Z96.xml
        <register>
          <name>btu_pta_mws_framesync_refpdb_cnt</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on MWS Frame Sync Pulse Interrupt</description>
          <addressOffset>0xF58</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsframesync_pdbitcnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on MWS Frame Sync Pulse Interrupt, Contains the reference pdBitCounter[12:0] when the MWS frame sync interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_pattern_refclk_0</name>
          <description>Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt</description>
          <addressOffset>0xF5A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwspattern_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS_PATTERN Pulse Interrupt, Contains the lower 16-bit of the referenceClock[27:2] when the MWS_Pattern_Real_Int interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_pattern_refclk_1</name>
          <description>Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt</description>
          <addressOffset>0xF5C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwspattern_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS_PATTERN Pulse Interrupt, Contains the upper 10-bit of the referenceClock[27:2] when the MWS_Pattern_Real_Int interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_pattern_refpdb_cnt</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on MWS_Pattern_Real_Int Interrupt</description>
          <addressOffset>0xF5E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwspattern_pdbitcnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on MWS_PATTERN Pulse Interrupt, Contains the reference pdBitCounter[12:0] when the MWS_Pattern_Real_Int interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_pattern_val</name>
          <description>MWS Coex Signal MWS_PATTERN Value</description>
          <addressOffset>0xF60</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwspatternreg</name>
              <description>MWS Coex Signal MWS_PATTERN Value, Contains the new MWS_PATTERN value being received. When new MWS_PATTERN is detected; the MWS_Pattern_Real_Int real-time interrupt will be generated and new value of MWS_PATTERN will be saved in here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>mwsscanfreqreg</name>
              <description>MWS Coex Signal MWS_SCAN_FREQUENCY Value, Contains the new MWS_SCAN_FREQUENCY value being received. When new non-zero MWS_SCAN_FREQUENCY is detected; the MWS_Scan_Frequency_Real_Int real-time interrupt will be generated and new value of MWS_SCAN_FREQUENCY will be saved here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_3dg_clk_update_refclk_0</name>
          <description>Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt</description>
          <addressOffset>0xF62</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt3dgclkupdate_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on 3D-Glass Clock Update Pulse Interrupt, Contrains the lower 16-bit of the referenceClock[27:2] when the 3D-Glass clock update interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_3dg_clk_update_refclk_1</name>
          <description>Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt</description>
          <addressOffset>0xF64</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt3dgclkupdate_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on 3D-Glass Clock Update Pulse Interrupt, Contrains the upper 10-bit of the referenceClock[27:2] when the 3D-Glass clock update interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_3dg_clk_update_refpdb_cnt</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on BT_3DG_CLK_UPDATE Pulse Interrupt</description>
          <addressOffset>0xF66</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt3dgclkupdate_pdbitcnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on 3D-Glass Clock Update Pulse Interrupt, Contrains the reference pdBitCounter[12:0] when the 3D-Glass clock update interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_scan_ovlp_range_1_4</name>
          <description>MWS Scan Frequency Overlap Range 1~4</description>
          <addressOffset>0xF68</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_1</name>
              <description>MWS scan frequency overlap range 1, The MWS scan frequency overlap range 1 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0001 during MWS scan operation., - Bit[3] indicates the direction: 0 = represents the upper boundary; the number of subgroups being overlapped counts forward from subgroup 0. 1 = represents the lower boundary; the number of subgroups being overlapped counts backward from subgroup 7. Bits[2:0] indicate the number of Bluetooth channel subgroups that fall into the overlap range., - Pre-defined encoding: 0000: no overlapped. 1000: all channel 0~78 overlapped. 0001: channel 0~9 are overlapped with lower MWS scan frequency band; channel 10~78 are not. 0010: channel 0~19 are overlapped with lower MWS scan frequency band; channel 20~78 are not. ... 1001: channel 70~78 are overlapped with upper MWS scan frequency band; channel 0~69 are not. 1010: channel 60~78 are overlapped with upper MWS scan frequency band; channel 0~59 are not. ...</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_2</name>
              <description>MWS scan frequency overlap range 2, The MWS scan frequency overlap range 2 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0010 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_3</name>
              <description>MWS scan frequency overlap range 3, The MWS scan frequency overlap range 3 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0011 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_4</name>
              <description>MWS scan frequency overlap range 4, The MWS scan frequency overlap range 4 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0100 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_scan_ovlp_range_5_8</name>
          <description>MWS Scan Frequency Overlap Range 5~8</description>
          <addressOffset>0xF6A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_5</name>
              <description>MWS scan frequency overlap range 5, The MWS scan frequency overlap range 5 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0101 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_6</name>
              <description>MWS scan frequency overlap range 6, The MWS scan frequency overlap range 6 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0110 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_7</name>
              <description>MWS scan frequency overlap range 7, The MWS scan frequency overlap range 7 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_0111 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_8</name>
              <description>MWS scan frequency overlap range 8, The MWS scan frequency overlap range 8 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1000 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_scan_ovlp_range_9_12</name>
          <description>MWS Scan Frequency Overlap Range 9~12</description>
          <addressOffset>0xF6C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_9</name>
              <description>MWS scan frequency overlap range 9, The MWS scan frequency overlap range 9 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1001 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_10</name>
              <description>MWS scan frequency overlap range 10, The MWS scan frequency overlap range 10 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1010 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_11</name>
              <description>MWS scan frequency overlap range 11, The MWS scan frequency overlap range 11 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1011 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_12</name>
              <description>MWS scan frequency overlap range 12, The MWS scan frequency overlap range 12 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1100 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_scan_ovlp_range_13_16</name>
          <description>MWS Scan Frequency Overlap Range 13~16</description>
          <addressOffset>0xF6E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_13</name>
              <description>MWS scan frequency overlap range 13, The MWS scan frequency overlap range 13 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1101 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_14</name>
              <description>MWS scan frequency overlap range 14, The MWS scan frequency overlap range 14 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1110 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_15</name>
              <description>MWS scan frequency overlap range 15, The MWS scan frequency overlap range 15 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b0_1111 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_16</name>
              <description>MWS scan frequency overlap range 16, The MWS scan frequency overlap range 16 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0000 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_scan_ovlp_range_17_20</name>
          <description>MWS Scan Frequency Overlap Range 17~20</description>
          <addressOffset>0xF70</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_17</name>
              <description>MWS scan frequency overlap range 17, The MWS scan frequency overlap range 17 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0001 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_18</name>
              <description>MWS scan frequency overlap range 18, The MWS scan frequency overlap range 18 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0010 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_19</name>
              <description>MWS scan frequency overlap range 19, The MWS scan frequency overlap range 19 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0011 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_20</name>
              <description>MWS scan frequency overlap range 20, The MWS scan frequency overlap range 20 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0100 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_scan_ovlp_range_21_24</name>
          <description>MWS Scan Frequency Overlap Range 21~24</description>
          <addressOffset>0xF72</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_21</name>
              <description>MWS scan frequency overlap range 21, The MWS scan frequency overlap range 21 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0101 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_22</name>
              <description>MWS scan frequency overlap range 22, The MWS scan frequency overlap range 22 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0110 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_23</name>
              <description>MWS scan frequency overlap range 23, The MWS scan frequency overlap range 23 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_0111 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_24</name>
              <description>MWS scan frequency overlap range 24, The MWS scan frequency overlap range 24 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1000 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_scan_ovlp_range_25_28</name>
          <description>MWS Scan Frequency Overlap Range 25~28</description>
          <addressOffset>0xF74</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_25</name>
              <description>MWS scan frequency overlap range 25, The MWS scan frequency overlap range 25 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1001 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_26</name>
              <description>MWS scan frequency overlap range 26, The MWS scan frequency overlap range 26 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1010 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_27</name>
              <description>MWS scan frequency overlap range 27, The MWS scan frequency overlap range 27 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1011 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_28</name>
              <description>MWS scan frequency overlap range 28, The MWS scan frequency overlap range 28 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1100 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
