nxp-mcuxpresso/mcux-soc-svd/KW43L43Z96/KW43L43Z96.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>REGFILE_0</name>
      <description>REGFILE</description>
      <groupName>REGFILE</groupName>
      <baseAddress>0x4018B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>REG[%s]</name>
          <description>Register File Register index</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG</name>
              <description>Register File</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TRDC_0_MGR</name>
      <description>TRDC</description>
      <groupName>TRDC0_MGR</groupName>
      <baseAddress>0x4018C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x53A4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRDC_CR</name>
          <description>TRDC Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GVLDM</name>
              <description>Global Valid for Domain Assignment Controllers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>TRDC DACs are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>TRDC DACs are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRL</name>
              <description>Hardware Revision Level</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GVLDB</name>
              <description>Global Valid for Memory Block Checkers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>TRDC MBCs are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>TRDC MBCs are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GVLDR</name>
              <description>Global Valid for Memory Region Checkers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>TRDC MRCs are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>TRDC MRCs are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK1</name>
              <description>Lock Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>The CR can be written by any secure privileged write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>The CR is locked (read-only) until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRDC_HWCFG0</name>
          <description>TRDC Hardware Configuration Register 0</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x20050802</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NDID</name>
              <description>Number of domains</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NMSTR</name>
              <description>Number of bus initiators</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NMBC</name>
              <description>Number of MBCs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NMRC</name>
              <description>Number of MRCs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MID</name>
              <description>Module ID</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRDC_HWCFG1</name>
          <description>TRDC Hardware Configuration Register 1</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>DID</name>
              <description>Domain identifier number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DACFG0</name>
          <description>Domain Assignment Configuration Register</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number of initiator domain assignment registers for bus initiator m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCM</name>
              <description>Non-CPU Initiator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Bus initiator is a processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_CPU</name>
                  <description>Bus initiator is a non-processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DACFG1</name>
          <description>Domain Assignment Configuration Register</description>
          <addressOffset>0x101</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number of initiator domain assignment registers for bus initiator m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCM</name>
              <description>Non-CPU Initiator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Bus initiator is a processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_CPU</name>
                  <description>Bus initiator is a non-processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DACFG2</name>
          <description>Domain Assignment Configuration Register</description>
          <addressOffset>0x102</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x81</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number of initiator domain assignment registers for bus initiator m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCM</name>
              <description>Non-CPU Initiator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Bus initiator is a processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_CPU</name>
                  <description>Bus initiator is a non-processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DACFG3</name>
          <description>Domain Assignment Configuration Register</description>
          <addressOffset>0x103</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x81</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number of initiator domain assignment registers for bus initiator m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCM</name>
              <description>Non-CPU Initiator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Bus initiator is a processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_CPU</name>
                  <description>Bus initiator is a non-processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DACFG4</name>
          <description>Domain Assignment Configuration Register</description>
          <addressOffset>0x104</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x81</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number of initiator domain assignment registers for bus initiator m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCM</name>
              <description>Non-CPU Initiator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Bus initiator is a processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_CPU</name>
                  <description>Bus initiator is a non-processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DACFG5</name>
          <description>Domain Assignment Configuration Register</description>
          <addressOffset>0x105</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x81</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number of initiator domain assignment registers for bus initiator m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCM</name>
              <description>Non-CPU Initiator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Bus initiator is a processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_CPU</name>
                  <description>Bus initiator is a non-processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DACFG6</name>
          <description>Domain Assignment Configuration Register</description>
          <addressOffset>0x106</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number of initiator domain assignment registers for bus initiator m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCM</name>
              <description>Non-CPU Initiator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Bus initiator is a processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_CPU</name>
                  <description>Bus initiator is a non-processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DACFG7</name>
          <description>Domain Assignment Configuration Register</description>
          <addressOffset>0x107</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x81</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NMDAR</name>
              <description>Number of initiator domain assignment registers for bus initiator m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCM</name>
              <description>Non-CPU Initiator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Bus initiator is a processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_CPU</name>
                  <description>Bus initiator is a non-processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
